tap "cloudflare/cloudflare", trusted: true
tap "lightpanda-io/browser"
tap "linzeyan/tools"
tap "rs/tap"
# Run your GitHub Actions locally
brew "act"
# Simple, modern, secure file encryption
brew "age"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Code searching, linting, rewriting
brew "ast-grep"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Parser generator
brew "bison"
# Core application library for C
brew "glib"
# Multi-shell multi-command argument completer
brew "carapace"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Cloudflare Tunnel client (formerly Argo Tunnel)
brew "cloudflared"
# CLI tool to convert your codebase into a single LLM prompt
brew "code2prompt"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# JSON, YAML, TOML, XML, and CSV query and modification tool
brew "dasel"
# Perform a dhcp-request to check whether a dhcp-server is running
brew "dhcping"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Visually compare two PDF files
brew "diff-pdf"
# Diff that understands syntax
brew "difftastic"
# Load/unload environment variables based on $PWD
brew "direnv"
# Tool for exploring each layer in a docker image
brew "dive"
# Synchronize your DNS to multiple providers from a simple DSL
brew "dnscontrol"
# Command-line DNS Client for Humans
brew "doggo"
# More intuitive version of du in rust
brew "dust"
# Program that can automate interactive applications
brew "expect"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Terminal JSON viewer
brew "fx"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# Library for encoding and decoding .avif files
brew "libavif"
# Graphics library to dynamically manipulate images
brew "gd"
# GNU database manager
brew "gdbm"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Render markdown on the CLI
brew "glow"
# Image manipulation
brew "netpbm"
# OpenType text shaping engine
brew "harfbuzz"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# Improved top (interactive process viewer)
brew "htop"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Calculate various network masks, etc. from a given IP address
brew "ipcalc"
# CLI wrapper for basic network utilities on macOS - ip command
brew "iproute2mac"
# New file format for still image compression
brew "jpeg-xl"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Image processing and image analysis library
brew "leptonica"
# Portable Foreign Function Interface library
brew "libffi"
# C library SSHv1/SSHv2 client and server protocols
brew "libssh"
# YAML Parser
brew "libyaml"
# Tools for zmodem/xmodem/ymodem file transfer
brew "lrzsz"
# Mac App Store command-line interface
brew "mas"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Deep clean and optimize your Mac
brew "mole"
# Command-line Git information tool
brew "onefetch"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Wrapper around ripgrep that adds multiple rich file types
brew "ripgrep-all"
# Utility that provides fast incremental file transfer
brew "rsync"
# CLI proxy to minimize LLM token consumption
brew "rtk"
# Terminal based presentation tool
brew "slides"
# Editor of encrypted files
brew "sops"
# Crypto and x509 Swiss-Army-Knife
brew "step"
# Easiest, most secure way to use WireGuard and 2FA
brew "tailscale"
# Traceroute implementation using TCP packets
brew "tcptraceroute"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Detect terminal injection, homograph, and pipe-to-shell attacks
brew "tirith"
# Terminal multiplexer
brew "tmux"
# Anonymizing overlay network for TCP
brew "tor"
# Vulnerability scanner for container images, file systems, and Git repos
brew "trivy"
# Compress/expand executable files
brew "upx"
# HTTP load testing tool and library
brew "vegeta"
# Execute commands when watched files change
brew "watchexec"
# Command-line client for WebSockets
brew "websocat"
# Internet file retriever
brew "wget"
# Tools for the WireGuard secure network tunnel
brew "wireguard-tools"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Headless browser for AI agents and automation (nightly build)
brew "lightpanda-io/browser/lightpanda", trusted: true
brew "linzeyan/tools/ops-cli", trusted: true
# JSON Aggregation CLI
brew "rs/tap/jaggr", trusted: true
# iTerm2 expvar/JSON monitoring tool
brew "rs/tap/jplot", trusted: true
# App for managing battery charging. (Also installs a CLI on first use.)
cask "battery"
# 3D creation suite
cask "blender"
# Terminal-based AI coding assistant
cask "claude-code"
# Free app that makes your Internet safer
cask "cloudflare-warp"
# Node-based image, video and audio generator
cask "comfy"
# Server and cloud storage browser
cask "cyberduck"
# Virtual monitor for screen sharing
cask "deskpad"
# Web browser
cask "firefox", args: { appdir: "/Applications" }
cask "font-fira-code-nerd-font"
# Web browser
cask "google-chrome", args: { appdir: "/Applications" }
# Tool for multi-language users
cask "input-source-pro"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2", args: { appdir: "/Applications" }
# Tool to show what is persistently installed on the computer
cask "knockknock"
# Application to spoof your iOS, iPadOS or iPhoneSimulator device location
cask "locationsimulator"
# Open-source firewall to block unknown outgoing connections
cask "lulu"
# Interactive tool for analyzing MongoDB data
cask "mongodb-compass"
# Free and open-source RSS reader
cask "netnewswire"
# Replacement for Docker Desktop
cask "orbstack"
# Collaboration platform for API development
cask "postman"
# HTTP debugging proxy
cask "proxyman"
# MySQL/MariaDB database management
cask "sequel-ace"
# Snip or pin screenshots
cask "snipaste", args: { appdir: "/Applications" }
# Mesh VPN based on WireGuard
cask "tailscale-app"
# Desktop client for Telegram messenger
cask "telegram-desktop"
# Disposable email client
cask "tempbox"
# Unpacks archive files
cask "the-unarchiver", args: { appdir: "/Applications" }
# Open-source code editor
cask "visual-studio-code"
mas "AdBlocker", id: 1018301773
mas "Amphetamine", id: 937984704
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 361285480
mas "LINE", id: 539883307
mas "Numbers", id: 361304891
mas "Pages", id: 361309726
mas "Xcode", id: 497799835
vscode "adpyke.codesnap"
vscode "ahmadalli.vscode-nginx-conf"
vscode "alfredbirk.go-to-next-change"
vscode "anthropic.claude-code"
vscode "arjun.swagger-viewer"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "christian-kohler.path-intellisense"
vscode "cipchk.zh-hans-tt-hant-vscode"
vscode "continue.continue"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "emeraldwalk.runonsave"
vscode "eriklynd.json-tools"
vscode "esbenp.prettier-vscode"
vscode "exiasr.hadolint"
vscode "ezforo.copy-relative-path-and-line-numbers"
vscode "fill-labs.dependi"
vscode "formulahendry.code-runner"
vscode "foxundermoon.shell-format"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "google.geminicodeassist"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.hcl"
vscode "hashicorp.terraform"
vscode "hediet.vscode-drawio"
vscode "huacnlee.autocorrect"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "jebbs.plantuml"
vscode "jinliming2.vscode-go-template"
vscode "kejun.devtoys"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "koihik.vscode-lua-format"
vscode "llvm-vs-code-extensions.lldb-dap"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "lunuan.kubernetes-templates"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "ms-ceintl.vscode-language-pack-zh-hant"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "mushan.vscode-paste-image"
vscode "nhoizey.gremlins"
vscode "oderwat.indent-rainbow"
vscode "openai.chatgpt"
vscode "pkief.material-icon-theme"
vscode "pomdtr.excalidraw-editor"
vscode "quicktype.quicktype"
vscode "randomfractalsinc.vscode-data-preview"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "shardulm94.trailing-spaces"
vscode "streetsidesoftware.code-spell-checker"
vscode "sumneko.lua"
vscode "svelte.svelte-vscode"
vscode "swiftlang.swift-vscode"
vscode "tamasfe.even-better-toml"
vscode "tauri-apps.tauri-vscode"
vscode "tim-koehler.helm-intellisense"
vscode "tombonnike.vscode-status-bar-format-toggle"
vscode "tooltitudeteam.tooltitude"
vscode "tooltitudeteam.tooltitude-pb"
vscode "usernamehw.errorlens"
vscode "vscode-icons-team.vscode-icons"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
vscode "zainchen.json"
vscode "ziglang.vscode-zig"
go "cmd/go"
go "cmd/gofmt"
go "mvdan.cc/gofumpt"
go "golang.org/x/tools/gopls"
cargo "diskus"
cargo "flamegraph"
cargo "ouch"
cargo "tealdeer"
uv "huggingface-hub", with: ["hf-xet"]
uv "litellm[proxy]"
uv "mflux"
uv "mlx"
uv "mlx-gen"
uv "mlx-lm", with: ["transformers git+https://github.com/huggingface/transformers.git"]
uv "mlx-video", with: ["torch"]
npm "corepack"
npm "eslint"
npm "html-minifier-terser"
npm "prettier"
npm "typescript"
